# /user/bin/evn/python
# -*- coding: utf-8 -*-
# Author:Ren Hang

"""
作业讲解
一、元素分类

有如下值集合 [11,22,33,44,55,66,77,88,99,90...]，将所有大于 66 的值保存至字典的第一个key中，将小于 66 的值保存至第二个key的值中。
即： {'k1': 大于66的所有值, 'k2': 小于66的所有值}
"""
# 方法1
li = [11, 22, 33, 44, 55, 66, 77, 88, 99, 90]
l1 = []
l2 = []
for i in li:
    if i < 66:
        l1.append(i)
    elif i > 66:
        l2.append(i)
temp = {"k1": l1, "k2": l2}
print(temp)
# {'k1': [11, 22, 33, 44, 55], 'k2': [77, 88, 99, 90]}

# 方法2
li = [11, 22, 33, 44, 55, 66, 77, 88, 99, 90]
dic = {
    'k1': [],
    'k2': []
}
for i in li:
    if i < 66:
        dic["k1"].append(i)

    elif i > 66:
        dic["k2"].append(i)

print(dic)
# {'k1': [11, 22, 33, 44, 55], 'k2': [77, 88, 99, 90]}
